xfire-java5/src/test/org/codehaus/xfire/annotations/jsr181/headerMessage.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns="urn:HeaderService">
 <env:Header>
  <header>two</header>
 </env:Header>
 <env:Body>
  <doSomething>
    <a>one</a>
    <b>three</b>
  </doSomething>
 </env:Body>
</env:Envelope>